# Curs 4: Pandas - elemente avansate

## Lucrul cu valori lipsa in Pandas

### Reprezentarea valorilor lipsa in Pandas

Pandas foloseste doua variante pentru reprezentarea de valori lipsa: None si NaN. NaN este utilizat pentru tipuri numerice in virgula mobila. None este convertit la NaN daca seria este numerica; daca seria este ne-numerica, se considera de tip `object`:

In [1]:
import pandas as pd
import numpy as np

In [2]:
print(f'pandas version: {pd.__version__}')
print(f'numpy version: {np.__version__}')

# pandas version: 1.0.1
# numpy version: 1.18.1

pandas version: 1.0.1
numpy version: 1.18.1

NaN si None sunt echivalene in context numeric, in Pandas:

In [3]:
pd.Series([1, np.nan, 2, None])

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

In [4]:
pd.Series(['John', 'Danny', None])

0     John
1    Danny
2     None
dtype: object

Intrucat doar tipurile numerice floating point suporta valoare de NaN, conform standardulului IEEE 754, se va face transformarea unei serii de tip intreg intr-una de tip floating point daca se insereaza sau adauga un NaN:

In [5]:
# creare de serie cu valori intregi
x = pd.Series([10, 20], dtype=int)
x

0    10
1    20
dtype: int32

In [6]:
x[1] = np.nan
x

0    10.0
1     NaN
dtype: float64

In [7]:
# adaugare cu append 
x = pd.Series([10, 20], dtype=int)
print(f'Serie de intregi:\n{x}')
x = x.append(pd.Series([100, np.nan]))
print(f'Dupa adaugare:\n{x}')

Serie de intregi:
0    10
1    20
dtype: int32
Dupa adaugare:
0     10.0
1     20.0
0    100.0
1      NaN
dtype: float64

### Operatii cu valori lipsa in Pandas

Metodele ce se pot folosi pentru operarea cu valori lipsa sunt:
* `isnull()` - genereaza o matrice de valori logice, ce specifica daca pe pozitiile corespunzatoare sunt valori lipsa
* `notnull()` - complementara lui `isnull()`
* `dropna()` - returneaza o versiune filtrata a datelor, doar acele linii care nu au null
* `fillna()` - returneaza o copie a obiectului initial, in care valorile lipsa sunt umplute cu ceva specificat

#### `isnull()` si `notnull()`

In [8]:
data = pd.Series([1, np.nan, 'hello', None])
data

0        1
1      NaN
2    hello
3     None
dtype: object

In [9]:
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [12]:
data.notnull()

0     True
1    False
2     True
3    False
dtype: bool

Selectarea doar acelor valori din obiectul Series care sunt ne-nule se face cu:

In [10]:
# filtrare
data[data.notnull()]

0        1
2    hello
dtype: object

Functiile `isnull()` si `notnull()` functioneaza la fel si pentru obiecte DataFrame:

In [13]:
df = pd.DataFrame({'Name': ['Will', 'Mary', 'Joan'], 'Age': [20, 25, 30]})
df

   Name  Age
0  Will   20
1  Mary   25
2  Joan   30

In [14]:
df.loc[2, 'Age'] = np.NaN
df

   Name   Age
0  Will  20.0
1  Mary  25.0
2  Joan   NaN

In [16]:
df.isnull()

    Name    Age
0  False  False
1  False  False
2  False   True

In [17]:
df.notnull()

   Name    Age
0  True   True
1  True   True
2  True  False

In cazul obiectelor DataFrame, aplicarea lui `notnull()` nu lasa afara elemente din dataframe:

In [18]:
df[df.notnull()]

   Name   Age
0  Will  20.0
1  Mary  25.0
2  Joan   NaN

#### Stergerea de elemente cu `dropna()`

Pentru un obiect Series, metoda `dropna()` produce un alt obiect in care liniile cu valori de null sunt sterse:

In [19]:
data

0        1
1      NaN
2    hello
3     None
dtype: object

In [21]:
data2 = data.dropna()
data2

0        1
2    hello
dtype: object

In [22]:
data

0        1
1      NaN
2    hello
3     None
dtype: object

Pentru un obiect DataFrame se pot sterge doar linii sau coloane in intregime - obiectul care ramane trebuie sa fie tot un DataFrame:

In [23]:
df = pd.DataFrame([[1, np.nan, 2],[2, 3, 5],[np.nan, 4, 6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [24]:
# Implicit: eliminare de linii care contin null
df2 = df.dropna()
df2

     0    1  2
1  2.0  3.0  5

Mai sus s-a ales implicit stergerea de linii, datorita faptului ca parametrul `axis` are implicit valoarea 0:

In [25]:
help(df.dropna)

Help on method dropna in module pandas.core.frame:

dropna(axis=0, how='any', thresh=None, subset=None, inplace=False) method of pandas.core.frame.DataFrame instance
    Remove missing values.

    See the :ref:`User Guide <missing_data>` for more on which values are
    considered missing, and how to work with missing data.

    Parameters
    ----------
    axis : {0 or 'index', 1 or 'columns'}, default 0
        Determine if rows or columns which contain missing values are
        removed.

        * 0, or 'index' : Drop rows which contain missing values.
        * 1, or 'columns' : Drop columns which contain missing value.

        .. versionchanged:: 1.0.0

           Pass tuple or list to drop on multiple axes.
           Only a single axis is allowed.

    how : {'any', 'all'}, default 'any'
        Determine if row or column is removed from DataFrame, when we have
        at least one NA or all NA.

        * 'any' : If any NA values are present, drop that row or column.
        * 'all' : If all values are NA, drop that row or column.

    thresh : int, optional
        Require that many non-NA values.
    subset : array-like, optional
        Labels along other axis to consider, e.g. if you are dropping rows
        these would be a list of columns to include.
    inplace : bool, default False
        If True, do operation inplace and return None.

    Returns
    -------
    DataFrame
        DataFrame with NA entries dropped from it.

    See Also
    --------
    DataFrame.isna: Indicate missing values.
    DataFrame.notna : Indicate existing (non-missing) values.
    DataFrame.fillna : Replace missing values.
    Series.dropna : Drop missing values.
    Index.dropna : Drop missing indices.

    Examples
    --------
    >>> df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
    ...                    "toy": [np.nan, 'Batmobile', 'Bullwhip'],
    ...                    "born": [pd.NaT, pd.Timestamp("1940-04-25"),
    ...                             pd.NaT]})
    >>> df
           name        toy       born
    0    Alfred        NaN        NaT
    1    Batman  Batmobile 1940-04-25
    2  Catwoman   Bullwhip        NaT

    Drop the rows where at least one element is missing.

    >>> df.dropna()
         name        toy       born
    1  Batman  Batmobile 1940-04-25

    Drop the columns where at least one element is missing.

    >>> df.dropna(axis='columns')
           name
    0    Alfred
    1    Batman
    2  Catwoman

    Drop the rows where all elements are missing.

    >>> df.dropna(how='all')
           name        toy       born
    0    Alfred        NaN        NaT
    1    Batman  Batmobile 1940-04-25
    2  Catwoman   Bullwhip        NaT

    Keep only the rows with at least 2 non-NA values.

    >>> df.dropna(thresh=2)
           name        toy       born
    1    Batman  Batmobile 1940-04-25
    2  Catwoman   Bullwhip        NaT

    Define in which columns to look for missing values.

    >>> df.dropna(subset=['name', 'born'])
           name        toy       born
    1    Batman  Batmobile 1940-04-25

    Keep the DataFrame with valid entries in the same variable.

    >>> df.dropna(inplace=True)
    >>> df
         name        toy       born
    1  Batman  Batmobile 1940-04-25

Se poate opta pentru stergerea de coloane care contin null:

In [26]:
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [27]:
# stergere de coloane cu null
# df3 = df.dropna(axis=1) # functioneaza
df3 = df.dropna(axis='columns')
df3

   2
0  2
1  5
2  6

Operatiile de mai sus sterg o linie sau o coloana daca ea contine cel putin o valoare de null. Se poate cere stergerea doar in cazul in care intreaga linie sau coloana e plina cu null, folosind parametrul `how`:

In [28]:
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [29]:
df2 = df.dropna(how='all')
df2

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

De remarcat ca `dropna()` nu modifica obiectul originar, decat daca se specifica parametrul `inplace=True`.

#### Umplerea de valori nule cu `fillna()`

In [30]:
data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))

In [31]:
# umplere cu valoare constanta
data2 = data.fillna(0)
data2

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [32]:
# Umplere cu copierea ultimei valori cunoscute:
data2 = data.fillna(method='ffill')
data2

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [33]:
# Umplere 'inapoi':
data2 = data.fillna(method='bfill')
data2

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

In [34]:
# umplerea cu valoare calculata:
print(f'Media valorilor non-nan este: {data.mean()}')
data2 = data.fillna(data.mean())
data2

Media valorilor non-nan este: 2.0

a    1.0
b    2.0
c    2.0
d    2.0
e    3.0
dtype: float64

## Agregare si grupare

### Agregari simple

In [35]:
np.random.seed(100)
ser = pd.Series(np.random.rand(10))
ser

0    0.543405
1    0.278369
2    0.424518
3    0.844776
4    0.004719
5    0.121569
6    0.670749
7    0.825853
8    0.136707
9    0.575093
dtype: float64

In [36]:
ser.sum(), ser.max(), ser.min()

(4.425757785871915, 0.8447761323199037, 0.004718856190972565)

Pentru obiecte DataFrame, operatiile de agregare opereaza pe coloane:

In [37]:
df = pd.DataFrame({'A': np.random.rand(10), 'B': -np.random.rand(10) }, index=['line ' + str(i) for i in range(1, 11)])
df

                A         B
line 1   0.891322 -0.431704
line 2   0.209202 -0.940030
line 3   0.185328 -0.817649
line 4   0.108377 -0.336112
line 5   0.219697 -0.175410
line 6   0.978624 -0.372832
line 7   0.811683 -0.005689
line 8   0.171941 -0.252426
line 9   0.816225 -0.795663
line 10  0.274074 -0.015255

In [38]:
df.mean()

A    0.466647
B   -0.414277
dtype: float64

.. si daca se doreste calculul pe linii, se poate indica via parametrul `axis`:

In [39]:
# df.mean(axis=1)
df.mean(axis='columns')

line 1     0.229809
line 2    -0.365414
line 3    -0.316161
line 4    -0.113868
line 5     0.022144
line 6     0.302896
line 7     0.402997
line 8    -0.040243
line 9     0.010281
line 10    0.129409
dtype: float64

Exista o metoda utila, care pentru un obiect DataFrame calculeaza statisticile:

In [41]:
df.describe(include='all')

               A          B
count  10.000000  10.000000
mean    0.466647  -0.414277
std     0.356280   0.333688
min     0.108377  -0.940030
25%     0.191297  -0.704673
50%     0.246886  -0.354472
75%     0.815089  -0.194664
max     0.978624  -0.005689

Operatiile nu iau in considerare valorile lipsa:

In [42]:
df.iloc[0, 0] = df.iloc[0,1] = np.nan
df.iloc[5, 0] = df.iloc[7, 1] = df.iloc[9, 1] = np.nan
df

                A         B
line 1        NaN       NaN
line 2   0.209202 -0.940030
line 3   0.185328 -0.817649
line 4   0.108377 -0.336112
line 5   0.219697 -0.175410
line 6        NaN -0.372832
line 7   0.811683 -0.005689
line 8   0.171941       NaN
line 9   0.816225 -0.795663
line 10  0.274074       NaN

In [43]:
df.describe(include='all')

              A         B
count  8.000000  7.000000
mean   0.349566 -0.491912
std    0.290390  0.359217
min    0.108377 -0.940030
25%    0.181981 -0.806656
50%    0.214450 -0.372832
75%    0.408476 -0.255761
max    0.816225 -0.005689

In [44]:
df.count()

A    8
B    7
dtype: int64


|  Metoda de agregare | Descriere  |
|---|---|
|  count() | Numarul total de elemente   |
|  first(), last() | primul si ultimul element  |
|  mean(), median() | Media si mediana  |
|  min(), max() | Minimul si maximul  |
|  std(), var()  | Deviatia standard si varianta  |
|  mad() | Deviatia absoluta medie  |
|  prod(), sum() | Produsul si suma elementelor  |

### Gruparea datelor: `split()`, `apply()`, `combine()`

Pasii care se fac pentru agregarea datelor urmeaza secventa: imparte, aplica operatie, combina:
1. imparte - via metoda `split()`: separa datele initiale in grupuri, pe baza unei chei
1. aplica, via metoda `apply()`: calculeaza o functie pentru fiecare grup: agregare, transformare, filtrare
1. combina, via metoda `combine()`: concateneaza rezultatele si produ raspunsul final

![Apply-split-combine](./images/asc.png)

In [45]:
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'], 'data': range(6)}, columns=['key', 'data'])
df

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [46]:
groups = df.groupby('key')
type(groups)

pandas.core.groupby.generic.DataFrameGroupBy

In [47]:
print(groups)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000024742508E48>

In [48]:
groups.sum()

     data
key
A       3
B       5
C       7

Ca functie de agregare se poate folosi orice functie Pandas sau NumPy.

In [49]:
import seaborn as sns
planets = sns.load_dataset('planets')

In [50]:
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [51]:
planets.describe(include='all')

,method,number,orbital_period,mass,distance,year
count,1035,1035.000000,992.000000,513.000000,808.000000,1035.000000
unique,10,NaN,NaN,NaN,NaN,NaN
top,Radial Velocity,NaN,NaN,NaN,NaN,NaN
freq,553,NaN,NaN,NaN,NaN,NaN
mean,NaN,1.785507,2002.917596,2.638161,264.069282,2009.070531
std,NaN,1.240976,26014.728304,3.818617,733.116493,3.972567
min,NaN,1.000000,0.090706,0.003600,1.350000,1989.000000
25%,NaN,1.000000,5.442540,0.229000,32.560000,2007.000000
50%,NaN,1.000000,39.979500,1.260000,55.250000,2010.000000
75%,NaN,2.000000,526.005000,3.040000,178.500000,2012.000000
max,NaN,7.000000,730000.000000,25.000000,8500.000000,2014.000000

In [52]:
planets.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1035 entries, 0 to 1034
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   method          1035 non-null   object
 1   number          1035 non-null   int64
 2   orbital_period  992 non-null    float64
 3   mass            513 non-null    float64
 4   distance        808 non-null    float64
 5   year            1035 non-null   int64
dtypes: float64(3), int64(2), object(1)
memory usage: 48.6+ KB

In [53]:
planets.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [54]:
planets['method'].unique()

array(['Radial Velocity', 'Imaging', 'Eclipse Timing Variations',
       'Transit', 'Astrometry', 'Transit Timing Variations',
       'Orbital Brightness Modulation', 'Microlensing', 'Pulsar Timing',
       'Pulsation Timing Variations'], dtype=object)

Pentru grupurile rezultate se poate alege o coloana, pentru care sa se calculeze valori agregate:

In [55]:
planets.groupby('method')['orbital_period'].median()

method
Astrometry                         631.180000
Eclipse Timing Variations         4343.500000
Imaging                          27500.000000
Microlensing                      3300.000000
Orbital Brightness Modulation        0.342887
Pulsar Timing                       66.541900
Pulsation Timing Variations       1170.000000
Radial Velocity                    360.200000
Transit                              5.714932
Transit Timing Variations           57.011000
Name: orbital_period, dtype: float64

Grupurile pot fi iterate, returnand pentru fiecare grup un obiect de tip Series sau DataFrame:

In [56]:
print(f'Number of columns: {len(planets.columns)}')

for (method, group) in planets.groupby('method'):
    print("{0:30s} shape={1}".format(method, group.shape))

Number of columns: 6
Astrometry                     shape=(2, 6)
Eclipse Timing Variations      shape=(9, 6)
Imaging                        shape=(38, 6)
Microlensing                   shape=(23, 6)
Orbital Brightness Modulation  shape=(3, 6)
Pulsar Timing                  shape=(5, 6)
Pulsation Timing Variations    shape=(1, 6)
Radial Velocity                shape=(553, 6)
Transit                        shape=(397, 6)
Transit Timing Variations      shape=(4, 6)

Fiecare grup rezultat, fiind vazut ca un Series sau DataFrame, suporta apel de metode aferete acestor obiecte:

In [57]:
planets.groupby('method')['year'].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,2011.500000,2.121320,2010.0,2010.75,2011.5,2012.25,2013.0
Eclipse Timing Variations,9.0,2010.000000,1.414214,2008.0,2009.00,2010.0,2011.00,2012.0
Imaging,38.0,2009.131579,2.781901,2004.0,2008.00,2009.0,2011.00,2013.0
Microlensing,23.0,2009.782609,2.859697,2004.0,2008.00,2010.0,2012.00,2013.0
Orbital Brightness Modulation,3.0,2011.666667,1.154701,2011.0,2011.00,2011.0,2012.00,2013.0
Pulsar Timing,5.0,1998.400000,8.384510,1992.0,1992.00,1994.0,2003.00,2011.0
Pulsation Timing Variations,1.0,2007.000000,NaN,2007.0,2007.00,2007.0,2007.00,2007.0
Radial Velocity,553.0,2007.518987,4.249052,1989.0,2005.00,2009.0,2011.00,2014.0
Transit,397.0,2011.236776,2.077867,2002.0,2010.00,2012.0,2013.00,2014.0
Transit Timing Variations,4.0,2012.500000,1.290994,2011.0,2011.75,2012.5,2013.25,2014.0

### Metodele `aggregate()`, `filter()`, `transform()`, `apply()`

Inainte de pasul de combinare a datelor se pot folosi metode care implementeaza operatii pe grupuri inainte de a face in final gruparea rezultatelor din grupuri.

In [58]:
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
'data1': range(6),
'data2': np.random.randint(0, 10, 6)},
columns = ['key', 'data1', 'data2'])
df

  key  data1  data2
0   A      0      5
1   B      1      8
2   C      2      1
3   A      3      0
4   B      4      7
5   C      5      6

Metoda `aggregate()` permite specificare de functii prin numele lor (string sau referinta la functie):

In [59]:
df.groupby('key').aggregate(['min', np.median, max])

    data1            data2
      min median max   min median max
key
A       0    1.5   3     0    2.5   5
B       1    2.5   4     7    7.5   8
C       2    3.5   5     1    3.5   6

Filtrarea cu `filter()` permite selectarea doar acelor grupuri care satisfac o anumita conditie:

In [63]:
def filter_func(x): # x este o linie, corespunzand fiecarui grup
    return x['data2'].std() > 3

In [64]:
df.groupby('key').std()

       data1     data2
key
A    2.12132  3.535534
B    2.12132  0.707107
C    2.12132  3.535534

In [65]:
df.groupby('key').filter(filter_func)

  key  data1  data2
0   A      0      5
2   C      2      1
3   A      3      0
5   C      5      6

Acelasi efect se obtine cu lambda functii:

In [67]:
df.groupby('key').filter(lambda row: row['data2'].std() > 3)

  key  data1  data2
0   A      0      5
2   C      2      1
3   A      3      0
5   C      5      6

Transformarea cu `transform()` produce un dataframe cu acelasi numar de linii ca si cel initial, dar cu valorile calculate prin aplicarea unei operatii la nivelul fiecarui grup:

In [68]:
df

  key  data1  data2
0   A      0      5
1   B      1      8
2   C      2      1
3   A      3      0
4   B      4      7
5   C      5      6

Media pe fieare grup este:

In [69]:
df.groupby('key').mean()

     data1  data2
key
A      1.5    2.5
B      2.5    7.5
C      3.5    3.5

Centrarea valorilor pentru fiecare grup - adica: in fiecare grup sa fie media 0 - se face cu:

In [70]:
df.groupby('key').transform(lambda x: x - x.mean())

   data1  data2
0   -1.5    2.5
1   -1.5    0.5
2   -1.5   -2.5
3    1.5   -2.5
4    1.5   -0.5
5    1.5    2.5

In [71]:
df.groupby('key').transform(lambda x: x - x.mean()).mean()

data1    0.0
data2    0.0
dtype: float64

Functia `apply()` permite calculul unei functii peste fiecare grup. Exemplul de mai jos calculeaza prima coloana impartita la suma elementelor din coloana data2, in cadrul fiecarui grup:

In [72]:
def norm_by_data2(x):
    # x is a DataFrame of group values
    x['data1'] /= x['data2'].sum()
    return x

df.groupby('key').apply(norm_by_data2)

  key     data1  data2
0   A  0.000000      5
1   B  0.066667      8
2   C  0.285714      1
3   A  0.600000      0
4   B  0.266667      7
5   C  0.714286      6

Functia `apply()` se poate folosi si in afara lui `groupby`, permitand calcul vectorizat de mare viteza:

In [74]:
data_len = 10000

df_big = pd.DataFrame({'Noise_' + str(i) : np.random.rand(data_len) for i in range(1, 50)})

df_big.head(n=10)

,Noise_1,Noise_2,Noise_3,Noise_4,Noise_5,Noise_6,Noise_7,Noise_8,Noise_9,Noise_10,...,Noise_40,Noise_41,Noise_42,Noise_43,Noise_44,Noise_45,Noise_46,Noise_47,Noise_48,Noise_49
0,0.196353,0.352651,0.613028,0.249506,0.055124,0.888742,0.868501,0.919829,0.748061,0.378847,...,0.210325,0.001095,0.994232,0.048446,0.938996,0.586045,0.534753,0.292593,0.306959,0.271803
1,0.979207,0.220012,0.092281,0.452351,0.432591,0.187272,0.409835,0.192545,0.302624,0.285094,...,0.694805,0.032451,0.822445,0.626288,0.477006,0.405464,0.916389,0.744862,0.713938,0.338098
2,0.161343,0.306800,0.178317,0.907895,0.450684,0.827479,0.601047,0.840924,0.947667,0.667206,...,0.320994,0.907617,0.945604,0.396348,0.359705,0.403739,0.817381,0.866073,0.880091,0.758908
3,0.580684,0.957874,0.641201,0.491717,0.520689,0.565689,0.839985,0.687343,0.864986,0.676208,...,0.904577,0.211677,0.960094,0.813119,0.718916,0.791904,0.417625,0.810889,0.620127,0.309975
4,0.727097,0.644491,0.648134,0.749379,0.843257,0.278933,0.892513,0.146440,0.501479,0.607693,...,0.177247,0.849879,0.799234,0.130391,0.760570,0.180546,0.598179,0.435547,0.566623,0.141914
5,0.205390,0.262027,0.366242,0.983053,0.786007,0.979797,0.320437,0.152980,0.139893,0.716527,...,0.341437,0.948126,0.635448,0.214349,0.434877,0.443212,0.461181,0.284910,0.331039,0.168196
6,0.683789,0.466113,0.521973,0.081378,0.690332,0.884005,0.220691,0.981087,0.026676,0.988457,...,0.216175,0.198195,0.038686,0.396749,0.095602,0.078744,0.363796,0.567958,0.071662,0.747746
7,0.015792,0.477706,0.563611,0.567482,0.967215,0.845371,0.196631,0.956319,0.174805,0.582808,...,0.136372,0.297189,0.957223,0.550263,0.404091,0.932406,0.215276,0.159265,0.904879,0.769532
8,0.820471,0.927495,0.339476,0.321277,0.510718,0.333188,0.095515,0.174412,0.371424,0.894755,...,0.387242,0.102030,0.998372,0.207390,0.545256,0.725589,0.677299,0.361534,0.652656,0.616405
9,0.411366,0.293458,0.350459,0.098101,0.376186,0.259866,0.638233,0.030835,0.350892,0.275260,...,0.907479,0.147697,0.708412,0.239343,0.930670,0.995410,0.483320,0.571038,0.612337,0.422056

In [75]:
all_noise_columns = [column for column in df_big.columns if column.startswith('Noise_')]

row = df_big.iloc[0]
row[all_noise_columns]

Noise_1     0.196353
Noise_2     0.352651
Noise_3     0.613028
Noise_4     0.249506
Noise_5     0.055124
Noise_6     0.888742
Noise_7     0.868501
Noise_8     0.919829
Noise_9     0.748061
Noise_10    0.378847
Noise_11    0.370004
Noise_12    0.845141
Noise_13    0.238365
Noise_14    0.078562
Noise_15    0.135510
Noise_16    0.404168
Noise_17    0.565020
Noise_18    0.820978
Noise_19    0.137176
Noise_20    0.934154
Noise_21    0.730879
Noise_22    0.314960
Noise_23    0.810880
Noise_24    0.873815
Noise_25    0.421446
Noise_26    0.497802
Noise_27    0.449914
Noise_28    0.078329
Noise_29    0.785899
Noise_30    0.838907
Noise_31    0.307845
Noise_32    0.182518
Noise_33    0.122738
Noise_34    0.207541
Noise_35    0.962871
Noise_36    0.224470
Noise_37    0.618868
Noise_38    0.306715
Noise_39    0.162594
Noise_40    0.210325
Noise_41    0.001095
Noise_42    0.994232
Noise_43    0.048446
Noise_44    0.938996
Noise_45    0.586045
Noise_46    0.534753
Noise_47    0.292593
Noise_48    0.306959
Noise_49    0.271803
Name: 0, dtype: float64

In [76]:
# %%timeit

df_big['All_noises'] = df_big.apply(lambda row: np.mean(row[all_noise_columns]) > 0.1, axis=1)

# 7.65 s ± 135 ms per loop (mean ± std. dev. of 7 runs, 1 loop each)

In [77]:
# %%timeit

for index in df_big.index:
    df_big.loc[index, 'All_noises'] = np.mean(df_big.loc[index, all_noise_columns]) > 0.1   
#  16.1 s ± 2.43 s per loop (mean ± std. dev. of 7 runs, 1 loop each)

## Tabele pivot

!['Titanic'](./images/titanic.jpg)

In [78]:
# Incarcarea datelor:

titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

Pornim de la urmatoarea problema: care este procentul de femei si barbati supravietuitori? Diferentierea de gen se face dupa coloana 'sex', iar supravietuirea este in coloana 'survived':

In [79]:
titanic.groupby('sex')['survived'].mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

Mai departe, se cere determinarea distributiei pe gen si clasa imbarcare, folosind `groupby()`:

In [80]:
titanic.groupby(['sex', 'class'])['survived'].aggregate('mean').unstack()

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

Acest tip de operatii (grupare dupa doua atribute, calcul de valori agregate) este des intalnit si se numeste pivotare. Pandas introduce suport nativ pentru pivotare, simplificand codul:

In [81]:
titanic.pivot_table('survived', index='sex', columns='class' )

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

Se poate face pivotare pe mai mult de doua niveluri (mai sus: sex si class). De exemplu, varsta poate fi adaugata pentru analiza, persoane sub 18 ani (copii) si cei peste 18 (adulti). In primul pas se poate face impartirea persoanelor pe cele doua subintervale de varsta (<=18, >18) folosind `cut`:

In [82]:
age = pd.cut(titanic['age'], [0, 18, 80], labels=['child', 'adult'])
age.head(15)

0     adult
1     adult
2     adult
3     adult
4     adult
5       NaN
6     adult
7     child
8     adult
9     child
10    child
11    adult
12    adult
13    adult
14    child
Name: age, dtype: category
Categories (2, object): [child < adult]

In [83]:
titanic.pivot_table('survived', ['sex', age], 'class')

class            First    Second     Third
sex    age
female child  0.909091  1.000000  0.511628
       adult  0.972973  0.900000  0.423729
male   child  0.800000  0.600000  0.215686
       adult  0.375000  0.071429  0.133663

In [84]:
fare_split = pd.cut(titanic.fare, 2, labels=['cheap fare', 'expensive fare'])

In [85]:
fare_split

0      cheap fare
1      cheap fare
2      cheap fare
3      cheap fare
4      cheap fare
          ...
886    cheap fare
887    cheap fare
888    cheap fare
889    cheap fare
890    cheap fare
Name: fare, Length: 891, dtype: category
Categories (2, object): [cheap fare < expensive fare]

In [86]:
titanic.pivot_table('survived', ['sex', age, fare_split], 'class')

class                           First    Second     Third
sex    age   fare
female child cheap fare      0.900000  1.000000  0.511628
             expensive fare  1.000000       NaN       NaN
       adult cheap fare      0.971429  0.900000  0.423729
             expensive fare  1.000000       NaN       NaN
male   child cheap fare      0.800000  0.600000  0.215686
       adult cheap fare      0.369565  0.071429  0.133663
             expensive fare  0.500000       NaN       NaN